# Δημήτρης Σαουρίδης Εργασία Άσκηση 1 7/4/2025
        
plhthos = 0  # Αρχικοποίηση πλήθους που προκρίθηκαν με επίδοση πάνω από 2,25
plhthos2 = 0  # Αρχικοποίηση πλήθους που προκρίθηκαν στον δεύτερο γύρο με επίδοση πάνω από 2,30

for i in range(0, 40, 1):  # Επανάληψη για τους 40 αθλητές
    epidosh = float(input("Δώσε μου την επίδοση του αθλητή: "))  # Διάβασμα της επίδοσης του αθλητή
    if epidosh > 2.25:
        plhthos = plhthos + 1

print("Το πλήθος που πέρασε τα 2,25 είναι:", plhthos)  # Εμφάνιση πλήθους που πέρασε τα 2,25

pososto = (plhthos / 40.0) * 100  # Υπολογισμός του ποσοστού για αυτούς που πέρασαν τα 2,25
print(f"Το ποσοστό που πέρασε τα 2,25 είναι: {pososto:.2f}%")  # Εμφάνιση ποσοστού

for i in range(0, plhthos, 1):  # Επανάληψη για όσους πέρασαν στον δεύτερο γύρο
    epidosh = float(input("Δώσε μου τη νέα επίδοση: "))  # Διάβασμα της νέας επίδοσης
    if epidosh > 2.30:
        plhthos2 += 1

print("Το πλήθος του δεύτερου γύρου που πέρασαν πάνω από 2,30 είναι:", plhthos2)  # Το συνολικό πλήθος που πέρασαν τα 2,30 στον δεύτερο γύρο

pososto2 = float(plhthos2 / plhthos) * 100  # Υπολογισμός ποσοστού για επίδοση 2,30+
print(f"Το ποσοστό του δεύτερου γύρου που πέρασε τα 2,30 είναι: {pososto2:.2f}%")  # Εμφάνιση του ποσοστού
